---
kind: method
id: M:Autodesk.Revit.UI.ComboBox.GetItems
source: html/b64c88a5-f3a5-0bb9-dcf7-e09f8b46c908.htm
---
# Autodesk.Revit.UI.ComboBox.GetItems Method

Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.

## Syntax (C#)
```csharp
public IList<ComboBoxMember> GetItems()
```